
taos> select DEGREES(0)
        degrees(0)         |
============================
         0.000000000000000 |

taos> select DEGREES(1)
        degrees(1)         |
============================
        57.295779513082323 |

taos> select DEGREES(1.5)
       degrees(1.5)        |
============================
        85.943669269623484 |

taos> select DEGREES(100)
       degrees(100)        |
============================
      5729.577951308232514 |

taos> select DEGREES(-1)
        degrees(-1)        |
============================
       -57.295779513082323 |

taos> select DEGREES(-1.5)
       degrees(-1.5)       |
============================
       -85.943669269623484 |

taos> select DEGREES(-100)
       degrees(-100)       |
============================
     -5729.577951308232514 |

taos> select DEGREES(1) + 1
      degrees(1) + 1       |
============================
        58.295779513082323 |

taos> select DEGREES(1) - 1
      degrees(1) - 1       |
============================
        56.295779513082323 |

taos> select DEGREES(1) * 1
      degrees(1) * 1       |
============================
        57.295779513082323 |

taos> select DEGREES(1) / 1
      degrees(1) / 1       |
============================
        57.295779513082323 |

taos> select DEGREES(1) from ts_4893.meters limit 5
        degrees(1)         |
============================
        57.295779513082323 |
        57.295779513082323 |
        57.295779513082323 |
        57.295779513082323 |
        57.295779513082323 |

taos> select DEGREES(1) + 1 from ts_4893.meters limit 1
      degrees(1) + 1       |
============================
        58.295779513082323 |

taos> select DEGREES(1) - 1 from ts_4893.meters limit 1
      degrees(1) - 1       |
============================
        56.295779513082323 |

taos> select DEGREES(1) * 2 from ts_4893.meters limit 1
      degrees(1) * 2       |
============================
       114.591559026164646 |

taos> select DEGREES(1) / 2 from ts_4893.meters limit 1
      degrees(1) / 2       |
============================
        28.647889756541161 |

taos> select DEGREES(2) + DEGREES(1) from ts_4893.meters limit 1
  degrees(2) + degrees(1)  |
============================
       171.887338539246969 |

taos> select DEGREES(2) - DEGREES(1) from ts_4893.meters limit 1
  degrees(2) - degrees(1)  |
============================
        57.295779513082323 |

taos> select DEGREES(2) * DEGREES(1) from ts_4893.meters limit 1
  degrees(2) * degrees(1)  |
============================
      6565.612700023488287 |

taos> select DEGREES(2) / DEGREES(1) from ts_4893.meters limit 1
  degrees(2) / degrees(1)  |
============================
         2.000000000000000 |

taos> select DEGREES(1) + id from ts_4893.meters order by ts limit 5
      degrees(1) + id      |
============================
        57.295779513082323 |
        58.295779513082323 |
        59.295779513082323 |
        60.295779513082323 |
        61.295779513082323 |

taos> select DEGREES(id) + id from ts_4893.meters order by ts limit 5
     degrees(id) + id      |
============================
         0.000000000000000 |
        58.295779513082323 |
       116.591559026164646 |
       174.887338539246969 |
       233.183118052329291 |

taos> select DEGREES(abs(10))
     degrees(abs(10))      |
============================
       572.957795130823229 |

taos> select DEGREES(PI())
       degrees(pi())       |
============================
       180.000000000000000 |

taos> select abs(DEGREES(10))
     abs(degrees(10))      |
============================
       572.957795130823229 |

taos> select pow(DEGREES(10), 2)
    pow(degrees(10), 2)    |
============================
    328280.635001174407080 |

taos> select sqrt(DEGREES(10))
     sqrt(degrees(10))     |
============================
        23.936536824085962 |

taos> select cast(DEGREES(10) as int)
 cast(degrees(10) as int) |
===========================
                      572 |

taos> select DEGREES(sqrt(id)) from ts_4893.meters order by ts limit 5
     degrees(sqrt(id))     |
============================
         0.000000000000000 |
        57.295779513082323 |
        81.028468454139556 |
        99.239201175922574 |
       114.591559026164646 |

taos> select degrees(pi())
       degrees(pi())       |
============================
       180.000000000000000 |

taos> select degrees(current) from ts_4893.d0 order by ts limit 10
     degrees(current)      |
============================
       610.200029957721426 |
       491.254034090376820 |
       561.212164701962479 |
       643.603479905018958 |
       613.408634263739941 |
       487.472513516777667 |
       549.810284033650078 |
       628.076328902558998 |
       643.202411196955836 |
       592.266466706882511 |

taos> select degrees(current) from ts_4893.meters order by ts limit 10
     degrees(current)      |
============================
       610.200029957721426 |
       491.254034090376820 |
       561.212164701962479 |
       643.603479905018958 |
       613.408634263739941 |
       487.472513516777667 |
       549.810284033650078 |
       628.076328902558998 |
       643.202411196955836 |
       592.266466706882511 |

taos> select degrees(null)
       degrees(null)       |
============================
 NULL                      |

taos> select degrees(-5)
        degrees(-5)        |
============================
      -286.478897565411614 |

taos> select degrees(3.14)
       degrees(3.14)       |
============================
       179.908747671078515 |

taos> select degrees(2*pi())
      degrees(2*pi())      |
============================
       360.000000000000000 |

taos> select degrees(pi()/2)
      degrees(pi()/2)      |
============================
        90.000000000000000 |

taos> select degrees(-pi()/2)
     degrees(-pi()/2)      |
============================
       -90.000000000000000 |

taos> select degrees(1000000)
     degrees(1000000)      |
============================
  57295779.513082325458527 |

taos> select degrees(sin(1))
      degrees(sin(1))      |
============================
        48.212736012209490 |

taos> select degrees(cos(1))
      degrees(cos(1))      |
============================
        30.957041787430903 |

taos> select degrees(tan(1))
      degrees(tan(1))      |
============================
        89.232889603798512 |

taos> select degrees(radians(90))
   degrees(radians(90))    |
============================
        90.000000000000000 |

taos> select degrees(atan(1))
     degrees(atan(1))      |
============================
        45.000000000000000 |

taos> select degrees(phase) from ts_4893.meters limit 1
      degrees(phase)       |
============================
        29.157708736569255 |

taos> select degrees(current) from ts_4893.meters limit 1
     degrees(current)      |
============================
       610.200029957721426 |

taos> select degrees(voltage) from ts_4893.meters limit 1
     degrees(voltage)      |
============================
     12662.367272391193183 |

