
taos> select EXP(0)
          exp(0)           |
============================
         1.000000000000000 |

taos> select EXP(1)
          exp(1)           |
============================
         2.718281828459045 |

taos> select EXP(1.5)
         exp(1.5)          |
============================
         4.481689070338065 |

taos> select EXP(100)
         exp(100)          |
============================
     2.688117141816136e+43 |

taos> select EXP(-1)
          exp(-1)          |
============================
         0.367879441171442 |

taos> select EXP(-1.5)
         exp(-1.5)         |
============================
         0.223130160148430 |

taos> select EXP(-100)
         exp(-100)         |
============================
         0.000000000000000 |

taos> select EXP(1) + 1
        exp(1) + 1         |
============================
         3.718281828459045 |

taos> select EXP(1) - 1
        exp(1) - 1         |
============================
         1.718281828459045 |

taos> select EXP(1) * 1
        exp(1) * 1         |
============================
         2.718281828459045 |

taos> select EXP(1) / 1
        exp(1) / 1         |
============================
         2.718281828459045 |

taos> select exp(1) from ts_4893.meters limit 5
          exp(1)           |
============================
         2.718281828459045 |
         2.718281828459045 |
         2.718281828459045 |
         2.718281828459045 |
         2.718281828459045 |

taos> select exp(1) + 1 from ts_4893.meters limit 1
        exp(1) + 1         |
============================
         3.718281828459045 |

taos> select exp(1) - 1 from ts_4893.meters limit 1
        exp(1) - 1         |
============================
         1.718281828459045 |

taos> select exp(1) * 2 from ts_4893.meters limit 1
        exp(1) * 2         |
============================
         5.436563656918090 |

taos> select exp(1) / 2 from ts_4893.meters limit 1
        exp(1) / 2         |
============================
         1.359140914229523 |

taos> select exp(2) + exp(1) from ts_4893.meters limit 1
      exp(2) + exp(1)      |
============================
        10.107337927389695 |

taos> select exp(2) - exp(1) from ts_4893.meters limit 1
      exp(2) - exp(1)      |
============================
         4.670774270471606 |

taos> select exp(2) * exp(1) from ts_4893.meters limit 1
      exp(2) * exp(1)      |
============================
        20.085536923187668 |

taos> select exp(2) / exp(1) from ts_4893.meters limit 1
      exp(2) / exp(1)      |
============================
         2.718281828459046 |

taos> select exp(1) + id from ts_4893.meters order by ts limit 5
        exp(1) + id        |
============================
         2.718281828459045 |
         3.718281828459045 |
         4.718281828459045 |
         5.718281828459045 |
         6.718281828459045 |

taos> select exp(id) + id from ts_4893.meters order by ts limit 5
       exp(id) + id        |
============================
         1.000000000000000 |
         3.718281828459045 |
         9.389056098930650 |
        23.085536923187668 |
        58.598150033144236 |

taos> select abs(EXP(10))
       abs(exp(10))        |
============================
     22026.465794806717895 |

taos> select pow(EXP(10), 2)
      pow(exp(10), 2)      |
============================
 485165195.409790337085724 |

taos> select sqrt(EXP(10))
       sqrt(exp(10))       |
============================
       148.413159102576600 |

taos> select cast(EXP(10) as int)
 cast(exp(10) as int) |
=======================
                22026 |

taos> select EXP(sqrt(id)) from ts_4893.meters order by ts limit 5
       exp(sqrt(id))       |
============================
         1.000000000000000 |
         2.718281828459045 |
         4.113250378782928 |
         5.652233674034091 |
         7.389056098930650 |

taos> select EXP(EXP(EXP(EXP(0))))
   exp(exp(exp(exp(0))))   |
============================
   3814279.104760214220732 |

taos> select exp(2)
          exp(2)           |
============================
         7.389056098930650 |

taos> select exp(0.5)
         exp(0.5)          |
============================
         1.648721270700128 |

taos> select exp(current) from ts_4893.d0 order by ts limit 10
       exp(current)        |
============================
     42192.578453635847836 |
      5292.258432380726845 |
     17943.802618770550907 |
     75583.992598717435612 |
     44622.804904812772293 |
      4954.246535954979663 |
     14705.836248958077704 |
     57641.604897186582093 |
     75056.754435561466380 |
     30853.327779395312973 |

taos> select exp(current) from ts_4893.meters order by ts limit 10
       exp(current)        |
============================
     42192.578453635847836 |
      5292.258432380726845 |
     17943.802618770550907 |
     75583.992598717435612 |
     44622.804904812772293 |
      4954.246535954979663 |
     14705.836248958077704 |
     57641.604897186582093 |
     75056.754435561466380 |
     30853.327779395312973 |

taos> select exp(null)
         exp(null)         |
============================
 NULL                      |

taos> select exp(100000)
        exp(100000)        |
============================
 NULL                      |

taos> select exp(-1000)
        exp(-1000)         |
============================
         0.000000000000000 |

taos> select exp(-9999999999)
     exp(-9999999999)      |
============================
         0.000000000000000 |

taos> select exp(0.0001)
        exp(0.0001)        |
============================
         1.000100005000167 |

taos> select exp(pi())
         exp(pi())         |
============================
        23.140692632779267 |

taos> select exp(voltage) from ts_4893.meters limit 1
       exp(voltage)        |
============================
     9.529727902367202e+95 |

taos> select exp(current) from ts_4893.meters limit 1
       exp(current)        |
============================
     42192.578453635847836 |

taos> select exp(phase) from ts_4893.meters limit 1
        exp(phase)         |
============================
         1.663457087766762 |

taos> select exp(voltage + current) from ts_4893.meters limit 1
  exp(voltage + current)   |
============================
    4.020837921624308e+100 |

taos> select exp(abs(current)) from ts_4893.meters limit 1
     exp(abs(current))     |
============================
     42192.578453635847836 |

taos> select exp(log(voltage)) from ts_4893.meters limit 1
     exp(log(voltage))     |
============================
       220.999999999999915 |

taos> select round(exp(voltage), 2) from ts_4893.meters limit 1
  round(exp(voltage), 2)   |
============================
     9.529727902367202e+95 |

