
taos> select LN(100)
          ln(100)          |
============================
         4.605170185988092 |

taos> select LN(1.5)
          ln(1.5)          |
============================
         0.405465108108164 |

taos> select LN(100)
          ln(100)          |
============================
         4.605170185988092 |

taos> select LN(100) + 1
        ln(100) + 1        |
============================
         5.605170185988092 |

taos> select LN(100) - 1
        ln(100) - 1        |
============================
         3.605170185988092 |

taos> select LN(100) * 1
        ln(100) * 1        |
============================
         4.605170185988092 |

taos> select LN(100) / 1
        ln(100) / 1        |
============================
         4.605170185988092 |

taos> select LN(100) from ts_4893.meters limit 5
          ln(100)          |
============================
         4.605170185988092 |
         4.605170185988092 |
         4.605170185988092 |
         4.605170185988092 |
         4.605170185988092 |

taos> select LN(100) + 1 from ts_4893.meters limit 1
        ln(100) + 1        |
============================
         5.605170185988092 |

taos> select LN(100) - 1 from ts_4893.meters limit 1
        ln(100) - 1        |
============================
         3.605170185988092 |

taos> select LN(100) * 2 from ts_4893.meters limit 1
        ln(100) * 2        |
============================
         9.210340371976184 |

taos> select LN(100) / 2 from ts_4893.meters limit 1
        ln(100) / 2        |
============================
         2.302585092994046 |

taos> select LN(2) + LN(100) from ts_4893.meters limit 1
      ln(2) + ln(100)      |
============================
         5.298317366548037 |

taos> select LN(2) - LN(100) from ts_4893.meters limit 1
      ln(2) - ln(100)      |
============================
        -3.912023005428146 |

taos> select LN(2) * LN(100) from ts_4893.meters limit 1
      ln(2) * ln(100)      |
============================
         3.192060730416365 |

taos> select LN(2) / LN(100) from ts_4893.meters limit 1
      ln(2) / ln(100)      |
============================
         0.150514997831991 |

taos> select LN(100) + id from ts_4893.meters order by ts limit 5
       ln(100) + id        |
============================
         4.605170185988092 |
         5.605170185988092 |
         6.605170185988092 |
         7.605170185988092 |
         8.605170185988092 |

taos> select LN(id + 1) + id from ts_4893.meters order by ts limit 5
      ln(id + 1) + id      |
============================
         0.000000000000000 |
         1.693147180559945 |
         3.098612288668110 |
         4.386294361119891 |
         5.609437912434101 |

taos> select ln(null)
         ln(null)          |
============================
 NULL                      |

taos> select ln(0)
           ln(0)           |
============================
 NULL                      |

taos> select ln(-5)
          ln(-5)           |
============================
 NULL                      |

taos> select abs(LN(10))
        abs(ln(10))        |
============================
         2.302585092994046 |

taos> select pow(LN(10), 2)
      pow(ln(10), 2)       |
============================
         5.301898110478399 |

taos> select sqrt(LN(10))
       sqrt(ln(10))        |
============================
         1.517427129385146 |

taos> select cast(LN(10) as int)
 cast(ln(10) as int) |
======================
                   2 |

taos> select LN(sqrt(id) + 1) from ts_4893.meters order by ts limit 5
     ln(sqrt(id) + 1)      |
============================
         0.000000000000000 |
         0.693147180559945 |
         0.881373587019543 |
         1.005052538742381 |
         1.098612288668110 |

taos> select LN(LN(LN(LN(10000))))
   ln(ln(ln(ln(10000))))   |
============================
        -0.226079864157595 |

taos> select LN(EXP(2))
        ln(exp(2))         |
============================
         2.000000000000000 |

taos> select ln(10)
          ln(10)           |
============================
         2.302585092994046 |

taos> select ln(pi())
         ln(pi())          |
============================
         1.144729885849400 |

taos> select ln(current) from ts_4893.d0 order by ts limit 10
        ln(current)        |
============================
         2.365559856336680 |
         2.148734409997751 |
         2.281872059185575 |
         2.418855857000369 |
         2.370804362614190 |
         2.141006941277850 |
         2.261346315560232 |
         2.394434736880126 |
         2.418232501568406 |
         2.335729681253415 |

taos> select ln(current) from ts_4893.meters order by ts limit 10
        ln(current)        |
============================
         2.365559856336680 |
         2.148734409997751 |
         2.281872059185575 |
         2.418855857000369 |
         2.370804362614190 |
         2.141006941277850 |
         2.261346315560232 |
         2.394434736880126 |
         2.418232501568406 |
         2.335729681253415 |

taos> select ln(1)
           ln(1)           |
============================
         0.000000000000000 |

taos> select ln(20)
          ln(20)           |
============================
         2.995732273553991 |

taos> select ln(100)
          ln(100)          |
============================
         4.605170185988092 |

taos> select ln(99999999999999)
    ln(99999999999999)     |
============================
        32.236191301916627 |

taos> select ln(0.1)
          ln(0.1)          |
============================
        -2.302585092994045 |

taos> select ln(2.718)
         ln(2.718)         |
============================
         0.999896315728952 |

taos> select ln(exp(1))
        ln(exp(1))         |
============================
         1.000000000000000 |

taos> select ln(voltage) from ts_4893.meters where voltage > 0 limit 1
        ln(voltage)        |
============================
         5.398162701517752 |

taos> select ln(current) from ts_4893.meters where current > 0 limit 1
        ln(current)        |
============================
         2.365559856336680 |

taos> select ln(phase) from ts_4893.meters where phase > 0 limit 1
         ln(phase)         |
============================
        -0.675507636551043 |

taos> select ln(exp(voltage)) from ts_4893.meters where voltage > 0 limit 1
     ln(exp(voltage))      |
============================
       221.000000000000000 |

taos> select ln(abs(current)) from ts_4893.meters where current != 0 limit 1
     ln(abs(current))      |
============================
         2.365559856336680 |

taos> select ln(sqrt(phase)) from ts_4893.meters where phase >= 0 limit 1
      ln(sqrt(phase))      |
============================
        -0.337753818275521 |

taos> select ln(log(current)) from ts_4893.meters where current > 1 limit 1
     ln(log(current))      |
============================
         0.861014719652538 |

