
taos> select pi()
           pi()            |
============================
         3.141592653589793 |

taos> select pi() + 1
         pi() + 1          |
============================
         4.141592653589793 |

taos> select pi() - 1
         pi() - 1          |
============================
         2.141592653589793 |

taos> select pi() * 2
         pi() * 2          |
============================
         6.283185307179586 |

taos> select pi() / 2
         pi() / 2          |
============================
         1.570796326794897 |

taos> select pi() from ts_4893.meters limit 5
           pi()            |
============================
         3.141592653589793 |
         3.141592653589793 |
         3.141592653589793 |
         3.141592653589793 |
         3.141592653589793 |

taos> select pi() + 1 from ts_4893.meters limit 1
         pi() + 1          |
============================
         4.141592653589793 |

taos> select pi() - 1 from ts_4893.meters limit 1
         pi() - 1          |
============================
         2.141592653589793 |

taos> select pi() * 2 from ts_4893.meters limit 1
         pi() * 2          |
============================
         6.283185307179586 |

taos> select pi() / 2 from ts_4893.meters limit 1
         pi() / 2          |
============================
         1.570796326794897 |

taos> select pi() + pi() from ts_4893.meters limit 1
        pi() + pi()        |
============================
         6.283185307179586 |

taos> select pi() - pi() from ts_4893.meters limit 1
        pi() - pi()        |
============================
         0.000000000000000 |

taos> select pi() * pi() from ts_4893.meters limit 1
        pi() * pi()        |
============================
         9.869604401089358 |

taos> select pi() / pi() from ts_4893.meters limit 1
        pi() / pi()        |
============================
         1.000000000000000 |

taos> select pi() + id from ts_4893.meters order by ts limit 5
         pi() + id         |
============================
         3.141592653589793 |
         4.141592653589793 |
         5.141592653589793 |
         6.141592653589793 |
         7.141592653589793 |

taos> select abs(pi())
         abs(pi())         |
============================
         3.141592653589793 |

taos> select pow(pi(), 2)
       pow(pi(), 2)        |
============================
         9.869604401089358 |

taos> select sqrt(pi())
        sqrt(pi())         |
============================
         1.772453850905516 |

taos> select cast(pi() as int)
 cast(pi() as int) |
====================
                 3 |

taos> select pi()
           pi()            |
============================
         3.141592653589793 |

taos> select substring_index(null, '.', 2)
 substring_index(null, '.', 2) |
================================
 NULL                          |

taos> select pi() + null
        pi() + null        |
============================
 NULL                      |

taos> select pi() * 0
         pi() * 0          |
============================
         0.000000000000000 |

taos> select pi() / 0
         pi() / 0          |
============================
 NULL                      |

taos> select pi() * 0.5
        pi() * 0.5         |
============================
         1.570796326794897 |

taos> select pi() * -1
         pi() * -1         |
============================
        -3.141592653589793 |

taos> select pi() * name from ts_4893.meters limit 1
        pi() * name        |
============================
         0.000000000000000 |

taos> select pi() * voltage from ts_4893.meters limit 1
      pi() * voltage       |
============================
       694.291976443344311 |

taos> select pi() * phase * 2 from ts_4893.meters limit 1
     pi() * phase * 2      |
============================
         3.197500560801395 |

taos> select round(pi(), 6)
      round(pi(), 6)       |
============================
         3.141593000000000 |

taos> select round(pi() * phase, 2) from ts_4893.meters limit 1
  round(pi() * phase, 2)   |
============================
         1.600000000000000 |

taos> select sqrt(pi() * voltage) from ts_4893.meters limit 1
   sqrt(pi() * voltage)    |
============================
        26.349420799010826 |

taos> select sqrt(current / pi()) from ts_4893.meters limit 1
   sqrt(current / pi())    |
============================
         1.841195309148865 |

taos> select abs(pi() * phase) from ts_4893.meters limit 1
     abs(pi() * phase)     |
============================
         1.598750280400697 |

taos> select log(pi() * voltage) from ts_4893.meters limit 1
    log(pi() * voltage)    |
============================
         6.542892587367153 |

taos> select voltage / pi() from ts_4893.meters limit 1
      voltage / pi()       |
============================
        70.346484846617741 |

taos> select id, case when voltage > 100 then pi() else pi() / 2 end from ts_4893.meters limit 1
     id      | case when voltage > 100 then pi() else pi() / 2 end |
====================================================================
           0 |                               3.141592653589793e+00 |

