
taos> select pi()
           pi()            |
============================
         3.141592653589793 |

taos> select pi() + 1
         pi() + 1          |
============================
         4.141592653589793 |

taos> select pi() - 1
         pi() - 1          |
============================
         2.141592653589793 |

taos> select pi() * 2
         pi() * 2          |
============================
         6.283185307179586 |

taos> select pi() / 2
         pi() / 2          |
============================
         1.570796326794897 |

taos> select pi() from ts_4893.meters limit 5
           pi()            |
============================
         3.141592653589793 |
         3.141592653589793 |
         3.141592653589793 |
         3.141592653589793 |
         3.141592653589793 |

taos> select pi() + 1 from ts_4893.meters limit 1
         pi() + 1          |
============================
         4.141592653589793 |

taos> select pi() - 1 from ts_4893.meters limit 1
         pi() - 1          |
============================
         2.141592653589793 |

taos> select pi() * 2 from ts_4893.meters limit 1
         pi() * 2          |
============================
         6.283185307179586 |

taos> select pi() / 2 from ts_4893.meters limit 1
         pi() / 2          |
============================
         1.570796326794897 |

taos> select pi() + pi() from ts_4893.meters limit 1
        pi() + pi()        |
============================
         6.283185307179586 |

taos> select pi() - pi() from ts_4893.meters limit 1
        pi() - pi()        |
============================
         0.000000000000000 |

taos> select pi() * pi() from ts_4893.meters limit 1
        pi() * pi()        |
============================
         9.869604401089358 |

taos> select pi() / pi() from ts_4893.meters limit 1
        pi() / pi()        |
============================
         1.000000000000000 |

taos> select pi() + id from ts_4893.meters order by ts limit 5
         pi() + id         |
============================
         3.141592653589793 |
         4.141592653589793 |
         5.141592653589793 |
         6.141592653589793 |
         7.141592653589793 |

taos> select abs(pi())
         abs(pi())         |
============================
         3.141592653589793 |

taos> select pow(pi(), 2)
       pow(pi(), 2)        |
============================
         9.869604401089358 |

taos> select sqrt(pi())
        sqrt(pi())         |
============================
         1.772453850905516 |

taos> select cast(pi() as int)
 cast(pi() as int) |
====================
                 3 |

taos> select pi()
           pi()            |
============================
         3.141592653589793 |

taos> select substring_index(null, '.', 2)
 substring_index(null, '.', 2) |
================================
 NULL                          |

