
taos> select RADIANS(0)
        radians(0)         |
============================
         0.000000000000000 |

taos> select RADIANS(1)
        radians(1)         |
============================
         0.017453292519943 |

taos> select RADIANS(1.5)
       radians(1.5)        |
============================
         0.026179938779915 |

taos> select RADIANS(100)
       radians(100)        |
============================
         1.745329251994330 |

taos> select RADIANS(-1)
        radians(-1)        |
============================
        -0.017453292519943 |

taos> select RADIANS(-1.5)
       radians(-1.5)       |
============================
        -0.026179938779915 |

taos> select RADIANS(-100)
       radians(-100)       |
============================
        -1.745329251994330 |

taos> select RADIANS(1) + 1
      radians(1) + 1       |
============================
         1.017453292519943 |

taos> select RADIANS(1) - 1
      radians(1) - 1       |
============================
        -0.982546707480057 |

taos> select RADIANS(1) * 1
      radians(1) * 1       |
============================
         0.017453292519943 |

taos> select RADIANS(1) / 1
      radians(1) / 1       |
============================
         0.017453292519943 |

taos> select RADIANS(1) from ts_4893.meters limit 5
        radians(1)         |
============================
         0.017453292519943 |
         0.017453292519943 |
         0.017453292519943 |
         0.017453292519943 |
         0.017453292519943 |

taos> select RADIANS(1) + 1 from ts_4893.meters limit 1
      radians(1) + 1       |
============================
         1.017453292519943 |

taos> select RADIANS(1) - 1 from ts_4893.meters limit 1
      radians(1) - 1       |
============================
        -0.982546707480057 |

taos> select RADIANS(1) * 2 from ts_4893.meters limit 1
      radians(1) * 2       |
============================
         0.034906585039887 |

taos> select RADIANS(1) / 2 from ts_4893.meters limit 1
      radians(1) / 2       |
============================
         0.008726646259972 |

taos> select RADIANS(2) + RADIANS(1) from ts_4893.meters limit 1
  radians(2) + radians(1)  |
============================
         0.052359877559830 |

taos> select RADIANS(2) - RADIANS(1) from ts_4893.meters limit 1
  radians(2) - radians(1)  |
============================
         0.017453292519943 |

taos> select RADIANS(2) * RADIANS(1) from ts_4893.meters limit 1
  radians(2) * radians(1)  |
============================
         0.000609234839573 |

taos> select RADIANS(2) / RADIANS(1) from ts_4893.meters limit 1
  radians(2) / radians(1)  |
============================
         2.000000000000000 |

taos> select RADIANS(1) + id from ts_4893.meters order by ts limit 5
      radians(1) + id      |
============================
         0.017453292519943 |
         1.017453292519943 |
         2.017453292519943 |
         3.017453292519943 |
         4.017453292519943 |

taos> select RADIANS(id) + id from ts_4893.meters order by ts limit 5
     radians(id) + id      |
============================
         0.000000000000000 |
         1.017453292519943 |
         2.034906585039887 |
         3.052359877559830 |
         4.069813170079773 |

taos> select RADIANS(abs(10))
     radians(abs(10))      |
============================
         0.174532925199433 |

taos> select RADIANS(DEGREES(PI()))
  radians(degrees(pi()))   |
============================
         3.141592653589793 |

taos> select abs(RADIANS(10))
     abs(radians(10))      |
============================
         0.174532925199433 |

taos> select pow(RADIANS(10), 2)
    pow(radians(10), 2)    |
============================
         0.030461741978671 |

taos> select sqrt(RADIANS(10))
     sqrt(radians(10))     |
============================
         0.417771379105167 |

taos> select cast(RADIANS(10) as int)
 cast(radians(10) as int) |
===========================
                        0 |

taos> select RADIANS(sqrt(id)) from ts_4893.meters order by ts limit 5
     radians(sqrt(id))     |
============================
         0.000000000000000 |
         0.017453292519943 |
         0.024682682989769 |
         0.030229989403904 |
         0.034906585039887 |

taos> select radians(180)
       radians(180)        |
============================
         3.141592653589793 |

taos> select radians(current) from ts_4893.d0 order by ts limit 10
     radians(current)      |
============================
         0.185877558679493 |
         0.149644536324422 |
         0.170955001564425 |
         0.196052831414414 |
         0.186854955444309 |
         0.148492619284422 |
         0.167481790094528 |
         0.191322990739406 |
         0.195930658899406 |
         0.180414682914441 |

taos> select radians(current) from ts_4893.meters order by ts limit 10
     radians(current)      |
============================
         0.185877558679493 |
         0.149644536324422 |
         0.170955001564425 |
         0.196052831414414 |
         0.186854955444309 |
         0.148492619284422 |
         0.167481790094528 |
         0.191322990739406 |
         0.195930658899406 |
         0.180414682914441 |

taos> select radians(null)
       radians(null)       |
============================
 NULL                      |

taos> select radians(0)
        radians(0)         |
============================
         0.000000000000000 |

taos> select radians(45)
        radians(45)        |
============================
         0.785398163397448 |

taos> select radians(-45)
       radians(-45)        |
============================
        -0.785398163397448 |

taos> select radians(90)
        radians(90)        |
============================
         1.570796326794897 |

taos> select radians(-90)
       radians(-90)        |
============================
        -1.570796326794897 |

taos> select radians(360)
       radians(360)        |
============================
         6.283185307179586 |

taos> select radians(1000000)
     radians(1000000)      |
============================
     17453.292519943293883 |

taos> select radians(sin(1))
      radians(sin(1))      |
============================
         0.014686439244897 |

taos> select radians(cos(1))
      radians(cos(1))      |
============================
         0.009430054193517 |

taos> select radians(tan(1))
      radians(tan(1))      |
============================
         0.027181892591221 |

taos> select radians(degrees(90))
   radians(degrees(90))    |
============================
        89.999999999999986 |

taos> select radians(atan(1))
     radians(atan(1))      |
============================
         0.013707783890402 |

taos> select radians(current) from ts_4893.meters limit 1
     radians(current)      |
============================
         0.185877558679493 |

taos> select radians(voltage) from ts_4893.meters limit 1
     radians(voltage)      |
============================
         3.857177646907469 |

taos> select radians(phase) from ts_4893.meters limit 1
      radians(phase)       |
============================
         0.008881946002226 |

